app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "22"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "asdfasdfadsf"], ["commenter", "asdfasdfasdfa"], ["created_at", Tue, 16 Jul 2013 16:16:25 UTC +00:00], ["post_id", 22], ["updated_at", Tue, 16 Jul 2013 16:16:25 UTC +00:00]]

  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "77"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 77], ["id", "3"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]