app/controllers/posts_controller.rb

	def index
  		@posts = Post.all
---
SELECT "posts".* FROM "posts"

    def create
    	#render text: params[:post].inspect
    	@post = Post.new(post_params)

  		if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 11 Jul 2013 13:56:04 UTC +00:00], ["text", "TTTTTTTTTTTT"], ["title", "TTTTTTTTTT"], ["updated_at", Thu, 11 Jul 2013 13:56:04 UTC +00:00]]

	def show
	  	@post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 22]]

	def edit
      	@post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]

	def update
	  	@post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]

	def destroy
		@post = Post.find(params[:id])
		@post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]